    /******************************************************************************
    
                                  Online C++ Compiler.
                   Code, Compile, Run and Debug C++ program online.
    Write your code in this editor and press "Run" button to compile and execute it.
    
    *******************************************************************************/
    
    #include <iostream>
    
    using namespace std;
    
    int main()
    {
        cout << "Перше завдання"<< endl;
        float a,b; //Ініціалізація значеннь
        cout << "Введіть перше значення: "; 
        cin >> a; // Присвоєння числа першому значенню
        cout << "Введіть друге значення: ";
        cin >> b; // Присвоєння числа другому значенню
        cout << "Середнє арифметичне: " << (a + b) / 2 <<endl; // Вивід результату
        cout << "Друге завдання"<< endl;
        float TC,TF; 
        cout << "Введіть кількість градусів у фаренгейтах: ";
        cin>>TF; // Присвоєння значення фаренгейтам 
        TC = (TF - 32) * 5/9; // Математична формула перетвонрення фаренгейтів у цельсії
        cout << "Кількість градусів у Цельсіях - " <<TC<< endl;  // Вивід результату
        return 0;
    }
